app/controllers/answers_controller.rb

    def create
        @question = Question.find(params[:question_id])

        @answer = @question.answers.create(answers_params)
        user_id = Question.find(@answer.question_id).user_id
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "answers" ("user_id", "question_id", "body", "likes", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 1], ["question_id", 3], ["body", "cdashfn"], ["likes", 0], ["created_at", 2016-10-30 13:14:41 UTC], ["updated_at", 2016-10-30 13:14:41 UTC]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 2], ["LIMIT", 1]]