app/controllers/comments_controller.rb

  def update
    user_id = User.first.id
---
SELECT  "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]