app/controllers/comments_controller.rb

  def update
    ans_id = params[:ans_id]
    likes = Answer.find(ans_id).likes+1
    user_id = Answer.find(ans_id).user_id
    Comment.create(user_id: current_user.id, answer_id: ans_id, likes: "1" )
    Answer.update(ans_id, likes: likes)
---
SELECT  "answers".* FROM "answers" WHERE "answers"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "comments" ("user_id", "answer_id", "likes", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["answer_id", 9], ["likes", true], ["created_at", 2016-10-31 16:39:13 UTC], ["updated_at", 2016-10-31 16:39:13 UTC]]
UPDATE "answers" SET "likes" = $1, "updated_at" = $2 WHERE "answers"."id" = $3  [["likes", nil], ["updated_at", 2016-10-30 20:50:55 UTC], ["id", 8]]