app/controllers/pages_controller.rb

SELECT "questions".* FROM "questions" ORDER BY "questions"."updated_at" DESC
---
  def index
    @notification = Notification.order(id: :desc).where(user_id: current_user.id)
    if params[:search]
        @question = Question.where(["LOWER(body) LIKE ?","%#{params[:search].downcase}%"])
    else
        @question = Question.order(updated_at: :desc).all