app/controllers/profiles_controller.rb

  def index
    @profile = Profile.where(user_id: current_user.id)
---
SELECT  "profiles".* FROM "profiles" WHERE "profiles"."user_id" = $1 LIMIT $2  [["user_id", 2], ["LIMIT", 1]]

  def create
      @user = User.find(current_user.id)

      profile_count = Profile.where(user_id: @user.id).count
      if(profile_count == 0)
        @prof = @user.profiles.create(profiles_params)
      else
        @prof = @user.profiles.update(profiles_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT COUNT(*) FROM "profiles" WHERE "profiles"."user_id" = $1  [["user_id", 2]]
INSERT INTO "profiles" ("user_id", "name", "bio", "school", "college", "work", "dob", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
UPDATE "profiles" SET "name" = $1, "bio" = $2, "school" = $3, "college" = $4, "work" = $5, "updated_at" = $6 WHERE "profiles"."id" = $7  [["name", "ronaldo"], ["bio", "realmadrid"], ["school", "real"], ["college", "eral"], ["work", "rael"], ["updated_at", 2016-11-02 08:46:28 UTC], ["id", 1]]

  def edit
    @profile = Profile.where(id: params[:id], user_id: params[:user_id])
    @profile = @profile.first
---
SELECT  "profiles".* FROM "profiles" WHERE "profiles"."id" = $1 AND "profiles"."user_id" = $2 ORDER BY "profiles"."id" ASC LIMIT $3  [["id", 1], ["user_id", 2], ["LIMIT", 1]]
SELECT "profiles".* FROM "profiles" WHERE (1)

  def update
      @user = User.find(current_user.id)

     @prof = @user.profiles.update(profiles_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "profiles" SET "work" = $1, "updated_at" = $2 WHERE "profiles"."id" = $3  [["work", "Commutatus"], ["updated_at", 2016-11-02 17:49:47 UTC], ["id", 1]]

  def set_profile
    @profile = Profile.where(params[:id], user_id: params[:user_id])
---
SELECT "profiles".* FROM "profiles" WHERE "profiles"."user_id" = $1  [["user_id", 2]]