app/controllers/questions_controller.rb

SELECT  "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]
INSERT INTO "questions" ("users_id", "body", "description", "tags", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["users_id", 1], ["body", "Who is PM of India?"], ["description", "bmnj"], ["tags", "mnhbjm"], ["created_at", 2016-10-30 10:39:51 UTC], ["updated_at", 2016-10-30 10:39:51 UTC]]
---
  def create
    @question = Question.new(question_params)
    @question.user_id = User.first.id

    respond_to do |format|
      if @question.save

UPDATE "questions" SET "description" = $1, "updated_at" = $2 WHERE "questions"."id" = $3  [["description", "his painting is by Victor Crisóstomo Gomez, a Peruvian painter, entitled “Wings of Freedom” (mixe"], ["updated_at", 2016-10-31 17:26:15 UTC], ["id", 6]]
---
  def update
    respond_to do |format|
      if @question.update(question_params)