app/controllers/users_controller.rb

  def update_profile
    @user = User.find(current_user.id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("username", "password", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["username", "se"], ["password", "whatever"], ["created_at", 2016-10-30 07:33:26 UTC], ["updated_at", 2016-10-30 07:33:26 UTC]]